[ClassDefinition.Class_HarpoonHovercraft VehicleClassDefinition]
DisplayName="ship"

[Weapon.WeaponTypes.WeaponType_Harpoon WeaponTypeDefinition]
Typename=" A car with a rock thrower"
PickupMessage="there %s"
UseFailureLevelMessage="You must be %d or greater to use this.."
UseFailureConstraintsMessage="This thing is not allowed."
NoManufacturerName="legally"

